virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/pio/sama5d27.h
/*
 * Peripheral I/O description for SAMA5D27
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-06-28T08:59:38Z */
#ifndef _SAMA5D27_GPIO_H_
#define _SAMA5D27_GPIO_H_

/* ========== Peripheral I/O pin numbers ========== */
#define PIN_PA0                     (  0  )  /**< Pin Number for PA0 */
#define PIN_PA1                     (  1  )  /**< Pin Number for PA1 */
#define PIN_PA2                     (  2  )  /**< Pin Number for PA2 */
#define PIN_PA3                     (  3  )  /**< Pin Number for PA3 */
#define PIN_PA4                     (  4  )  /**< Pin Number for PA4 */
#define PIN_PA5                     (  5  )  /**< Pin Number for PA5 */
#define PIN_PA6                     (  6  )  /**< Pin Number for PA6 */
#define PIN_PA7                     (  7  )  /**< Pin Number for PA7 */
#define PIN_PA8                     (  8  )  /**< Pin Number for PA8 */
#define PIN_PA9                     (  9  )  /**< Pin Number for PA9 */
#define PIN_PA10                    ( 10  )  /**< Pin Number for PA10 */
#define PIN_PA11                    ( 11  )  /**< Pin Number for PA11 */
#define PIN_PA12                    ( 12  )  /**< Pin Number for PA12 */
#define PIN_PA13                    ( 13  )  /**< Pin Number for PA13 */
#define PIN_PA14                    ( 14  )  /**< Pin Number for PA14 */
#define PIN_PA15                    ( 15  )  /**< Pin Number for PA15 */
#define PIN_PA16                    ( 16  )  /**< Pin Number for PA16 */
#define PIN_PA17                    ( 17  )  /**< Pin Number for PA17 */
#define PIN_PA18                    ( 18  )  /**< Pin Number for PA18 */
#define PIN_PA19                    ( 19  )  /**< Pin Number for PA19 */
#define PIN_PA20                    ( 20  )  /**< Pin Number for PA20 */
#define PIN_PA21                    ( 21  )  /**< Pin Number for PA21 */
#define PIN_PA22                    ( 22  )  /**< Pin Number for PA22 */
#define PIN_PA23                    ( 23  )  /**< Pin Number for PA23 */
#define PIN_PA24                    ( 24  )  /**< Pin Number for PA24 */
#define PIN_PA25                    ( 25  )  /**< Pin Number for PA25 */
#define PIN_PA26                    ( 26  )  /**< Pin Number for PA26 */
#define PIN_PA27                    ( 27  )  /**< Pin Number for PA27 */
#define PIN_PA28                    ( 28  )  /**< Pin Number for PA28 */
#define PIN_PA29                    ( 29  )  /**< Pin Number for PA29 */
#define PIN_PA30                    ( 30  )  /**< Pin Number for PA30 */
#define PIN_PA31                    ( 31  )  /**< Pin Number for PA31 */
#define PIN_PB0                     ( 32  )  /**< Pin Number for PB0 */
#define PIN_PB1                     ( 33  )  /**< Pin Number for PB1 */
#define PIN_PB2                     ( 34  )  /**< Pin Number for PB2 */
#define PIN_PB3                     ( 35  )  /**< Pin Number for PB3 */
#define PIN_PB4                     ( 36  )  /**< Pin Number for PB4 */
#define PIN_PB5                     ( 37  )  /**< Pin Number for PB5 */
#define PIN_PB6                     ( 38  )  /**< Pin Number for PB6 */
#define PIN_PB7                     ( 39  )  /**< Pin Number for PB7 */
#define PIN_PB8                     ( 40  )  /**< Pin Number for PB8 */
#define PIN_PB9                     ( 41  )  /**< Pin Number for PB9 */
#define PIN_PB10                    ( 42  )  /**< Pin Number for PB10 */
#define PIN_PB11                    ( 43  )  /**< Pin Number for PB11 */
#define PIN_PB12                    ( 44  )  /**< Pin Number for PB12 */
#define PIN_PB13                    ( 45  )  /**< Pin Number for PB13 */
#define PIN_PB14                    ( 46  )  /**< Pin Number for PB14 */
#define PIN_PB15                    ( 47  )  /**< Pin Number for PB15 */
#define PIN_PB16                    ( 48  )  /**< Pin Number for PB16 */
#define PIN_PB17                    ( 49  )  /**< Pin Number for PB17 */
#define PIN_PB18                    ( 50  )  /**< Pin Number for PB18 */
#define PIN_PB19                    ( 51  )  /**< Pin Number for PB19 */
#define PIN_PB20                    ( 52  )  /**< Pin Number for PB20 */
#define PIN_PB21                    ( 53  )  /**< Pin Number for PB21 */
#define PIN_PB22                    ( 54  )  /**< Pin Number for PB22 */
#define PIN_PB23                    ( 55  )  /**< Pin Number for PB23 */
#define PIN_PB24                    ( 56  )  /**< Pin Number for PB24 */
#define PIN_PB25                    ( 57  )  /**< Pin Number for PB25 */
#define PIN_PB26                    ( 58  )  /**< Pin Number for PB26 */
#define PIN_PB27                    ( 59  )  /**< Pin Number for PB27 */
#define PIN_PB28                    ( 60  )  /**< Pin Number for PB28 */
#define PIN_PB29                    ( 61  )  /**< Pin Number for PB29 */
#define PIN_PB30                    ( 62  )  /**< Pin Number for PB30 */
#define PIN_PB31                    ( 63  )  /**< Pin Number for PB31 */
#define PIN_PC0                     ( 64  )  /**< Pin Number for PC0 */
#define PIN_PC1                     ( 65  )  /**< Pin Number for PC1 */
#define PIN_PC2                     ( 66  )  /**< Pin Number for PC2 */
#define PIN_PC3                     ( 67  )  /**< Pin Number for PC3 */
#define PIN_PC4                     ( 68  )  /**< Pin Number for PC4 */
#define PIN_PC5                     ( 69  )  /**< Pin Number for PC5 */
#define PIN_PC6                     ( 70  )  /**< Pin Number for PC6 */
#define PIN_PC7                     ( 71  )  /**< Pin Number for PC7 */
#define PIN_PC8                     ( 72  )  /**< Pin Number for PC8 */
#define PIN_PC9                     ( 73  )  /**< Pin Number for PC9 */
#define PIN_PC10                    ( 74  )  /**< Pin Number for PC10 */
#define PIN_PC11                    ( 75  )  /**< Pin Number for PC11 */
#define PIN_PC12                    ( 76  )  /**< Pin Number for PC12 */
#define PIN_PC13                    ( 77  )  /**< Pin Number for PC13 */
#define PIN_PC14                    ( 78  )  /**< Pin Number for PC14 */
#define PIN_PC15                    ( 79  )  /**< Pin Number for PC15 */
#define PIN_PC16                    ( 80  )  /**< Pin Number for PC16 */
#define PIN_PC17                    ( 81  )  /**< Pin Number for PC17 */
#define PIN_PC18                    ( 82  )  /**< Pin Number for PC18 */
#define PIN_PC19                    ( 83  )  /**< Pin Number for PC19 */
#define PIN_PC20                    ( 84  )  /**< Pin Number for PC20 */
#define PIN_PC21                    ( 85  )  /**< Pin Number for PC21 */
#define PIN_PC22                    ( 86  )  /**< Pin Number for PC22 */
#define PIN_PC23                    ( 87  )  /**< Pin Number for PC23 */
#define PIN_PC24                    ( 88  )  /**< Pin Number for PC24 */
#define PIN_PC25                    ( 89  )  /**< Pin Number for PC25 */
#define PIN_PC26                    ( 90  )  /**< Pin Number for PC26 */
#define PIN_PC27                    ( 91  )  /**< Pin Number for PC27 */
#define PIN_PC28                    ( 92  )  /**< Pin Number for PC28 */
#define PIN_PC29                    ( 93  )  /**< Pin Number for PC29 */
#define PIN_PC30                    ( 94  )  /**< Pin Number for PC30 */
#define PIN_PC31                    ( 95  )  /**< Pin Number for PC31 */
#define PIN_PD0                     ( 96  )  /**< Pin Number for PD0 */
#define PIN_PD1                     ( 97  )  /**< Pin Number for PD1 */
#define PIN_PD2                     ( 98  )  /**< Pin Number for PD2 */
#define PIN_PD3                     ( 99  )  /**< Pin Number for PD3 */
#define PIN_PD4                     (100  )  /**< Pin Number for PD4 */
#define PIN_PD5                     (101  )  /**< Pin Number for PD5 */
#define PIN_PD6                     (102  )  /**< Pin Number for PD6 */
#define PIN_PD7                     (103  )  /**< Pin Number for PD7 */
#define PIN_PD8                     (104  )  /**< Pin Number for PD8 */
#define PIN_PD9                     (105  )  /**< Pin Number for PD9 */
#define PIN_PD10                    (106  )  /**< Pin Number for PD10 */
#define PIN_PD11                    (107  )  /**< Pin Number for PD11 */
#define PIN_PD12                    (108  )  /**< Pin Number for PD12 */
#define PIN_PD13                    (109  )  /**< Pin Number for PD13 */
#define PIN_PD14                    (110  )  /**< Pin Number for PD14 */
#define PIN_PD15                    (111  )  /**< Pin Number for PD15 */
#define PIN_PD16                    (112  )  /**< Pin Number for PD16 */
#define PIN_PD17                    (113  )  /**< Pin Number for PD17 */
#define PIN_PD18                    (114  )  /**< Pin Number for PD18 */
#define PIN_PD19                    (115  )  /**< Pin Number for PD19 */
#define PIN_PD20                    (116  )  /**< Pin Number for PD20 */
#define PIN_PD21                    (117  )  /**< Pin Number for PD21 */
#define PIN_PD22                    (118  )  /**< Pin Number for PD22 */
#define PIN_PD23                    (119  )  /**< Pin Number for PD23 */
#define PIN_PD24                    (120  )  /**< Pin Number for PD24 */
#define PIN_PD25                    (121  )  /**< Pin Number for PD25 */
#define PIN_PD26                    (122  )  /**< Pin Number for PD26 */
#define PIN_PD27                    (123  )  /**< Pin Number for PD27 */
#define PIN_PD28                    (124  )  /**< Pin Number for PD28 */
#define PIN_PD29                    (125  )  /**< Pin Number for PD29 */
#define PIN_PD30                    (126  )  /**< Pin Number for PD30 */
#define PIN_PD31                    (127  )  /**< Pin Number for PD31 */

/* ========== Peripheral I/O masks ========== */
#define PIO_PA0                     (_U_(1) << 0)   /**< PIO mask for PA0 */
#define PIO_PA1                     (_U_(1) << 1)   /**< PIO mask for PA1 */
#define PIO_PA2                     (_U_(1) << 2)   /**< PIO mask for PA2 */
#define PIO_PA3                     (_U_(1) << 3)   /**< PIO mask for PA3 */
#define PIO_PA4                     (_U_(1) << 4)   /**< PIO mask for PA4 */
#define PIO_PA5                     (_U_(1) << 5)   /**< PIO mask for PA5 */
#define PIO_PA6                     (_U_(1) << 6)   /**< PIO mask for PA6 */
#define PIO_PA7                     (_U_(1) << 7)   /**< PIO mask for PA7 */
#define PIO_PA8                     (_U_(1) << 8)   /**< PIO mask for PA8 */
#define PIO_PA9                     (_U_(1) << 9)   /**< PIO mask for PA9 */
#define PIO_PA10                    (_U_(1) << 10)  /**< PIO mask for PA10 */
#define PIO_PA11                    (_U_(1) << 11)  /**< PIO mask for PA11 */
#define PIO_PA12                    (_U_(1) << 12)  /**< PIO mask for PA12 */
#define PIO_PA13                    (_U_(1) << 13)  /**< PIO mask for PA13 */
#define PIO_PA14                    (_U_(1) << 14)  /**< PIO mask for PA14 */
#define PIO_PA15                    (_U_(1) << 15)  /**< PIO mask for PA15 */
#define PIO_PA16                    (_U_(1) << 16)  /**< PIO mask for PA16 */
#define PIO_PA17                    (_U_(1) << 17)  /**< PIO mask for PA17 */
#define PIO_PA18                    (_U_(1) << 18)  /**< PIO mask for PA18 */
#define PIO_PA19                    (_U_(1) << 19)  /**< PIO mask for PA19 */
#define PIO_PA20                    (_U_(1) << 20)  /**< PIO mask for PA20 */
#define PIO_PA21                    (_U_(1) << 21)  /**< PIO mask for PA21 */
#define PIO_PA22                    (_U_(1) << 22)  /**< PIO mask for PA22 */
#define PIO_PA23                    (_U_(1) << 23)  /**< PIO mask for PA23 */
#define PIO_PA24                    (_U_(1) << 24)  /**< PIO mask for PA24 */
#define PIO_PA25                    (_U_(1) << 25)  /**< PIO mask for PA25 */
#define PIO_PA26                    (_U_(1) << 26)  /**< PIO mask for PA26 */
#define PIO_PA27                    (_U_(1) << 27)  /**< PIO mask for PA27 */
#define PIO_PA28                    (_U_(1) << 28)  /**< PIO mask for PA28 */
#define PIO_PA29                    (_U_(1) << 29)  /**< PIO mask for PA29 */
#define PIO_PA30                    (_U_(1) << 30)  /**< PIO mask for PA30 */
#define PIO_PA31                    (_U_(1) << 31)  /**< PIO mask for PA31 */
#define PIO_PB0                     (_U_(1) << 0)   /**< PIO mask for PB0 */
#define PIO_PB1                     (_U_(1) << 1)   /**< PIO mask for PB1 */
#define PIO_PB2                     (_U_(1) << 2)   /**< PIO mask for PB2 */
#define PIO_PB3                     (_U_(1) << 3)   /**< PIO mask for PB3 */
#define PIO_PB4                     (_U_(1) << 4)   /**< PIO mask for PB4 */
#define PIO_PB5                     (_U_(1) << 5)   /**< PIO mask for PB5 */
#define PIO_PB6                     (_U_(1) << 6)   /**< PIO mask for PB6 */
#define PIO_PB7                     (_U_(1) << 7)   /**< PIO mask for PB7 */
#define PIO_PB8                     (_U_(1) << 8)   /**< PIO mask for PB8 */
#define PIO_PB9                     (_U_(1) << 9)   /**< PIO mask for PB9 */
#define PIO_PB10                    (_U_(1) << 10)  /**< PIO mask for PB10 */
#define PIO_PB11                    (_U_(1) << 11)  /**< PIO mask for PB11 */
#define PIO_PB12                    (_U_(1) << 12)  /**< PIO mask for PB12 */
#define PIO_PB13                    (_U_(1) << 13)  /**< PIO mask for PB13 */
#define PIO_PB14                    (_U_(1) << 14)  /**< PIO mask for PB14 */
#define PIO_PB15                    (_U_(1) << 15)  /**< PIO mask for PB15 */
#define PIO_PB16                    (_U_(1) << 16)  /**< PIO mask for PB16 */
#define PIO_PB17                    (_U_(1) << 17)  /**< PIO mask for PB17 */
#define PIO_PB18                    (_U_(1) << 18)  /**< PIO mask for PB18 */
#define PIO_PB19                    (_U_(1) << 19)  /**< PIO mask for PB19 */
#define PIO_PB20                    (_U_(1) << 20)  /**< PIO mask for PB20 */
#define PIO_PB21                    (_U_(1) << 21)  /**< PIO mask for PB21 */
#define PIO_PB22                    (_U_(1) << 22)  /**< PIO mask for PB22 */
#define PIO_PB23                    (_U_(1) << 23)  /**< PIO mask for PB23 */
#define PIO_PB24                    (_U_(1) << 24)  /**< PIO mask for PB24 */
#define PIO_PB25                    (_U_(1) << 25)  /**< PIO mask for PB25 */
#define PIO_PB26                    (_U_(1) << 26)  /**< PIO mask for PB26 */
#define PIO_PB27                    (_U_(1) << 27)  /**< PIO mask for PB27 */
#define PIO_PB28                    (_U_(1) << 28)  /**< PIO mask for PB28 */
#define PIO_PB29                    (_U_(1) << 29)  /**< PIO mask for PB29 */
#define PIO_PB30                    (_U_(1) << 30)  /**< PIO mask for PB30 */
#define PIO_PB31                    (_U_(1) << 31)  /**< PIO mask for PB31 */
#define PIO_PC0                     (_U_(1) << 0)   /**< PIO mask for PC0 */
#define PIO_PC1                     (_U_(1) << 1)   /**< PIO mask for PC1 */
#define PIO_PC2                     (_U_(1) << 2)   /**< PIO mask for PC2 */
#define PIO_PC3                     (_U_(1) << 3)   /**< PIO mask for PC3 */
#define PIO_PC4                     (_U_(1) << 4)   /**< PIO mask for PC4 */
#define PIO_PC5                     (_U_(1) << 5)   /**< PIO mask for PC5 */
#define PIO_PC6                     (_U_(1) << 6)   /**< PIO mask for PC6 */
#define PIO_PC7                     (_U_(1) << 7)   /**< PIO mask for PC7 */
#define PIO_PC8                     (_U_(1) << 8)   /**< PIO mask for PC8 */
#define PIO_PC9                     (_U_(1) << 9)   /**< PIO mask for PC9 */
#define PIO_PC10                    (_U_(1) << 10)  /**< PIO mask for PC10 */
#define PIO_PC11                    (_U_(1) << 11)  /**< PIO mask for PC11 */
#define PIO_PC12                    (_U_(1) << 12)  /**< PIO mask for PC12 */
#define PIO_PC13                    (_U_(1) << 13)  /**< PIO mask for PC13 */
#define PIO_PC14                    (_U_(1) << 14)  /**< PIO mask for PC14 */
#define PIO_PC15                    (_U_(1) << 15)  /**< PIO mask for PC15 */
#define PIO_PC16                    (_U_(1) << 16)  /**< PIO mask for PC16 */
#define PIO_PC17                    (_U_(1) << 17)  /**< PIO mask for PC17 */
#define PIO_PC18                    (_U_(1) << 18)  /**< PIO mask for PC18 */
#define PIO_PC19                    (_U_(1) << 19)  /**< PIO mask for PC19 */
#define PIO_PC20                    (_U_(1) << 20)  /**< PIO mask for PC20 */
#define PIO_PC21                    (_U_(1) << 21)  /**< PIO mask for PC21 */
#define PIO_PC22                    (_U_(1) << 22)  /**< PIO mask for PC22 */
#define PIO_PC23                    (_U_(1) << 23)  /**< PIO mask for PC23 */
#define PIO_PC24                    (_U_(1) << 24)  /**< PIO mask for PC24 */
#define PIO_PC25                    (_U_(1) << 25)  /**< PIO mask for PC25 */
#define PIO_PC26                    (_U_(1) << 26)  /**< PIO mask for PC26 */
#define PIO_PC27                    (_U_(1) << 27)  /**< PIO mask for PC27 */
#define PIO_PC28                    (_U_(1) << 28)  /**< PIO mask for PC28 */
#define PIO_PC29                    (_U_(1) << 29)  /**< PIO mask for PC29 */
#define PIO_PC30                    (_U_(1) << 30)  /**< PIO mask for PC30 */
#define PIO_PC31                    (_U_(1) << 31)  /**< PIO mask for PC31 */
#define PIO_PD0                     (_U_(1) << 0)   /**< PIO mask for PD0 */
#define PIO_PD1                     (_U_(1) << 1)   /**< PIO mask for PD1 */
#define PIO_PD2                     (_U_(1) << 2)   /**< PIO mask for PD2 */
#define PIO_PD3                     (_U_(1) << 3)   /**< PIO mask for PD3 */
#define PIO_PD4                     (_U_(1) << 4)   /**< PIO mask for PD4 */
#define PIO_PD5                     (_U_(1) << 5)   /**< PIO mask for PD5 */
#define PIO_PD6                     (_U_(1) << 6)   /**< PIO mask for PD6 */
#define PIO_PD7                     (_U_(1) << 7)   /**< PIO mask for PD7 */
#define PIO_PD8                     (_U_(1) << 8)   /**< PIO mask for PD8 */
#define PIO_PD9                     (_U_(1) << 9)   /**< PIO mask for PD9 */
#define PIO_PD10                    (_U_(1) << 10)  /**< PIO mask for PD10 */
#define PIO_PD11                    (_U_(1) << 11)  /**< PIO mask for PD11 */
#define PIO_PD12                    (_U_(1) << 12)  /**< PIO mask for PD12 */
#define PIO_PD13                    (_U_(1) << 13)  /**< PIO mask for PD13 */
#define PIO_PD14                    (_U_(1) << 14)  /**< PIO mask for PD14 */
#define PIO_PD15                    (_U_(1) << 15)  /**< PIO mask for PD15 */
#define PIO_PD16                    (_U_(1) << 16)  /**< PIO mask for PD16 */
#define PIO_PD17                    (_U_(1) << 17)  /**< PIO mask for PD17 */
#define PIO_PD18                    (_U_(1) << 18)  /**< PIO mask for PD18 */
#define PIO_PD19                    (_U_(1) << 19)  /**< PIO mask for PD19 */
#define PIO_PD20                    (_U_(1) << 20)  /**< PIO mask for PD20 */
#define PIO_PD21                    (_U_(1) << 21)  /**< PIO mask for PD21 */
#define PIO_PD22                    (_U_(1) << 22)  /**< PIO mask for PD22 */
#define PIO_PD23                    (_U_(1) << 23)  /**< PIO mask for PD23 */
#define PIO_PD24                    (_U_(1) << 24)  /**< PIO mask for PD24 */
#define PIO_PD25                    (_U_(1) << 25)  /**< PIO mask for PD25 */
#define PIO_PD26                    (_U_(1) << 26)  /**< PIO mask for PD26 */
#define PIO_PD27                    (_U_(1) << 27)  /**< PIO mask for PD27 */
#define PIO_PD28                    (_U_(1) << 28)  /**< PIO mask for PD28 */
#define PIO_PD29                    (_U_(1) << 29)  /**< PIO mask for PD29 */
#define PIO_PD30                    (_U_(1) << 30)  /**< PIO mask for PD30 */
#define PIO_PD31                    (_U_(1) << 31)  /**< PIO mask for PD31 */

