virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/pio/sama5d27.h
#define PIN_PC6F_ISC_HSYNC                         _L_(70)      /**< ISC signal: ISC_HSYNC on PC6 mux F */
#define MUX_PC6F_ISC_HSYNC                         _L_(5)       /**< ISC signal line function value: ISC_HSYNC */
#define PIO_PC6F_ISC_HSYNC                         (_U_(1) << 6) /**< ISC signal: ISC_HSYNC */
#define PIN_PC23C_ISC_HSYNC                        _L_(87)      /**< ISC signal: ISC_HSYNC on PC23 mux C */
#define MUX_PC23C_ISC_HSYNC                        _L_(2)       /**< ISC signal line function value: ISC_HSYNC */
#define PIO_PC23C_ISC_HSYNC                        (_U_(1) << 23) /**< ISC signal: ISC_HSYNC */
#define PIN_PD17E_ISC_HSYNC                        _L_(113)     /**< ISC signal: ISC_HSYNC on PD17 mux E */
#define MUX_PD17E_ISC_HSYNC                        _L_(4)       /**< ISC signal line function value: ISC_HSYNC */
#define PIO_PD17E_ISC_HSYNC                        (_U_(1) << 17) /**< ISC signal: ISC_HSYNC */
#define PIN_PD22F_ISC_HSYNC                        _L_(118)     /**< ISC signal: ISC_HSYNC on PD22 mux F */
#define MUX_PD22F_ISC_HSYNC                        _L_(5)       /**< ISC signal line function value: ISC_HSYNC */
#define PIO_PD22F_ISC_HSYNC                        (_U_(1) << 22) /**< ISC signal: ISC_HSYNC */
#define PIN_PC7F_ISC_MCK                           _L_(71)      /**< ISC signal: ISC_MCK on PC7 mux F */
#define MUX_PC7F_ISC_MCK                           _L_(5)       /**< ISC signal line function value: ISC_MCK */
#define PIO_PC7F_ISC_MCK                           (_U_(1) << 7) /**< ISC signal: ISC_MCK */
#define PIN_PC24C_ISC_MCK                          _L_(88)      /**< ISC signal: ISC_MCK on PC24 mux C */
#define MUX_PC24C_ISC_MCK                          _L_(2)       /**< ISC signal line function value: ISC_MCK */
#define PIO_PC24C_ISC_MCK                          (_U_(1) << 24) /**< ISC signal: ISC_MCK */
#define PIN_PD2E_ISC_MCK                           _L_(98)      /**< ISC signal: ISC_MCK on PD2 mux E */
#define MUX_PD2E_ISC_MCK                           _L_(4)       /**< ISC signal line function value: ISC_MCK */
#define PIO_PD2E_ISC_MCK                           (_U_(1) << 2) /**< ISC signal: ISC_MCK */
#define PIN_PD11F_ISC_MCK                          _L_(107)     /**< ISC signal: ISC_MCK on PD11 mux F */
#define MUX_PD11F_ISC_MCK                          _L_(5)       /**< ISC signal line function value: ISC_MCK */
#define PIO_PD11F_ISC_MCK                          (_U_(1) << 11) /**< ISC signal: ISC_MCK */
#define PIN_PC4F_ISC_PCK                           _L_(68)      /**< ISC signal: ISC_PCK on PC4 mux F */
#define MUX_PC4F_ISC_PCK                           _L_(5)       /**< ISC signal line function value: ISC_PCK */
#define PIO_PC4F_ISC_PCK                           (_U_(1) << 4) /**< ISC signal: ISC_PCK */
#define PIN_PC21C_ISC_PCK                          _L_(85)      /**< ISC signal: ISC_PCK on PC21 mux C */
#define MUX_PC21C_ISC_PCK                          _L_(2)       /**< ISC signal line function value: ISC_PCK */
#define PIO_PC21C_ISC_PCK                          (_U_(1) << 21) /**< ISC signal: ISC_PCK */
#define PIN_PD15E_ISC_PCK                          _L_(111)     /**< ISC signal: ISC_PCK on PD15 mux E */
#define MUX_PD15E_ISC_PCK                          _L_(4)       /**< ISC signal line function value: ISC_PCK */
#define PIO_PD15E_ISC_PCK                          (_U_(1) << 15) /**< ISC signal: ISC_PCK */
#define PIN_PD20F_ISC_PCK                          _L_(116)     /**< ISC signal: ISC_PCK on PD20 mux F */
#define MUX_PD20F_ISC_PCK                          _L_(5)       /**< ISC signal line function value: ISC_PCK */
#define PIO_PD20F_ISC_PCK                          (_U_(1) << 20) /**< ISC signal: ISC_PCK */
#define PIN_PC5F_ISC_VSYNC                         _L_(69)      /**< ISC signal: ISC_VSYNC on PC5 mux F */
#define MUX_PC5F_ISC_VSYNC                         _L_(5)       /**< ISC signal line function value: ISC_VSYNC */
#define PIO_PC5F_ISC_VSYNC                         (_U_(1) << 5) /**< ISC signal: ISC_VSYNC */
#define PIN_PC22C_ISC_VSYNC                        _L_(86)      /**< ISC signal: ISC_VSYNC on PC22 mux C */
#define MUX_PC22C_ISC_VSYNC                        _L_(2)       /**< ISC signal line function value: ISC_VSYNC */
#define PIO_PC22C_ISC_VSYNC                        (_U_(1) << 22) /**< ISC signal: ISC_VSYNC */
#define PIN_PD16E_ISC_VSYNC                        _L_(112)     /**< ISC signal: ISC_VSYNC on PD16 mux E */
#define MUX_PD16E_ISC_VSYNC                        _L_(4)       /**< ISC signal line function value: ISC_VSYNC */
#define PIO_PD16E_ISC_VSYNC                        (_U_(1) << 16) /**< ISC signal: ISC_VSYNC */
#define PIN_PD21F_ISC_VSYNC                        _L_(117)     /**< ISC signal: ISC_VSYNC on PD21 mux F */
#define MUX_PD21F_ISC_VSYNC                        _L_(5)       /**< ISC signal line function value: ISC_VSYNC */
#define PIO_PD21F_ISC_VSYNC                        (_U_(1) << 21) /**< ISC signal: ISC_VSYNC */
/* ========== PIO definition for LCDC peripheral ========== */
#define PIN_PB11A_LCDC_LCDDAT0                     _L_(43)      /**< LCDC signal: LCDC_LCDDAT0 on PB11 mux A */
#define MUX_PB11A_LCDC_LCDDAT0                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT0 */
#define PIO_PB11A_LCDC_LCDDAT0                     (_U_(1) << 11) /**< LCDC signal: LCDC_LCDDAT0 */
#define PIN_PB12A_LCDC_LCDDAT1                     _L_(44)      /**< LCDC signal: LCDC_LCDDAT1 on PB12 mux A */
#define MUX_PB12A_LCDC_LCDDAT1                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT1 */
#define PIO_PB12A_LCDC_LCDDAT1                     (_U_(1) << 12) /**< LCDC signal: LCDC_LCDDAT1 */
#define PIN_PB13A_LCDC_LCDDAT2                     _L_(45)      /**< LCDC signal: LCDC_LCDDAT2 on PB13 mux A */
#define MUX_PB13A_LCDC_LCDDAT2                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT2 */
#define PIO_PB13A_LCDC_LCDDAT2                     (_U_(1) << 13) /**< LCDC signal: LCDC_LCDDAT2 */
#define PIN_PC10A_LCDC_LCDDAT2                     _L_(74)      /**< LCDC signal: LCDC_LCDDAT2 on PC10 mux A */
#define MUX_PC10A_LCDC_LCDDAT2                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT2 */
#define PIO_PC10A_LCDC_LCDDAT2                     (_U_(1) << 10) /**< LCDC signal: LCDC_LCDDAT2 */
#define PIN_PB14A_LCDC_LCDDAT3                     _L_(46)      /**< LCDC signal: LCDC_LCDDAT3 on PB14 mux A */
#define MUX_PB14A_LCDC_LCDDAT3                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT3 */
#define PIO_PB14A_LCDC_LCDDAT3                     (_U_(1) << 14) /**< LCDC signal: LCDC_LCDDAT3 */
#define PIN_PC11A_LCDC_LCDDAT3                     _L_(75)      /**< LCDC signal: LCDC_LCDDAT3 on PC11 mux A */
#define MUX_PC11A_LCDC_LCDDAT3                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT3 */
#define PIO_PC11A_LCDC_LCDDAT3                     (_U_(1) << 11) /**< LCDC signal: LCDC_LCDDAT3 */
#define PIN_PB15A_LCDC_LCDDAT4                     _L_(47)      /**< LCDC signal: LCDC_LCDDAT4 on PB15 mux A */
#define MUX_PB15A_LCDC_LCDDAT4                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT4 */
#define PIO_PB15A_LCDC_LCDDAT4                     (_U_(1) << 15) /**< LCDC signal: LCDC_LCDDAT4 */
#define PIN_PC12A_LCDC_LCDDAT4                     _L_(76)      /**< LCDC signal: LCDC_LCDDAT4 on PC12 mux A */
#define MUX_PC12A_LCDC_LCDDAT4                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT4 */
#define PIO_PC12A_LCDC_LCDDAT4                     (_U_(1) << 12) /**< LCDC signal: LCDC_LCDDAT4 */
#define PIN_PB16A_LCDC_LCDDAT5                     _L_(48)      /**< LCDC signal: LCDC_LCDDAT5 on PB16 mux A */
#define MUX_PB16A_LCDC_LCDDAT5                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT5 */
#define PIO_PB16A_LCDC_LCDDAT5                     (_U_(1) << 16) /**< LCDC signal: LCDC_LCDDAT5 */
#define PIN_PC13A_LCDC_LCDDAT5                     _L_(77)      /**< LCDC signal: LCDC_LCDDAT5 on PC13 mux A */
#define MUX_PC13A_LCDC_LCDDAT5                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT5 */
#define PIO_PC13A_LCDC_LCDDAT5                     (_U_(1) << 13) /**< LCDC signal: LCDC_LCDDAT5 */
#define PIN_PB17A_LCDC_LCDDAT6                     _L_(49)      /**< LCDC signal: LCDC_LCDDAT6 on PB17 mux A */
#define MUX_PB17A_LCDC_LCDDAT6                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT6 */
#define PIO_PB17A_LCDC_LCDDAT6                     (_U_(1) << 17) /**< LCDC signal: LCDC_LCDDAT6 */
#define PIN_PC14A_LCDC_LCDDAT6                     _L_(78)      /**< LCDC signal: LCDC_LCDDAT6 on PC14 mux A */
#define MUX_PC14A_LCDC_LCDDAT6                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT6 */
#define PIO_PC14A_LCDC_LCDDAT6                     (_U_(1) << 14) /**< LCDC signal: LCDC_LCDDAT6 */
#define PIN_PB18A_LCDC_LCDDAT7                     _L_(50)      /**< LCDC signal: LCDC_LCDDAT7 on PB18 mux A */
#define MUX_PB18A_LCDC_LCDDAT7                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT7 */
#define PIO_PB18A_LCDC_LCDDAT7                     (_U_(1) << 18) /**< LCDC signal: LCDC_LCDDAT7 */
#define PIN_PC15A_LCDC_LCDDAT7                     _L_(79)      /**< LCDC signal: LCDC_LCDDAT7 on PC15 mux A */
#define MUX_PC15A_LCDC_LCDDAT7                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT7 */
#define PIO_PC15A_LCDC_LCDDAT7                     (_U_(1) << 15) /**< LCDC signal: LCDC_LCDDAT7 */
#define PIN_PB19A_LCDC_LCDDAT8                     _L_(51)      /**< LCDC signal: LCDC_LCDDAT8 on PB19 mux A */
#define MUX_PB19A_LCDC_LCDDAT8                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT8 */
#define PIO_PB19A_LCDC_LCDDAT8                     (_U_(1) << 19) /**< LCDC signal: LCDC_LCDDAT8 */
#define PIN_PB20A_LCDC_LCDDAT9                     _L_(52)      /**< LCDC signal: LCDC_LCDDAT9 on PB20 mux A */
#define MUX_PB20A_LCDC_LCDDAT9                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT9 */
#define PIO_PB20A_LCDC_LCDDAT9                     (_U_(1) << 20) /**< LCDC signal: LCDC_LCDDAT9 */
#define PIN_PB21A_LCDC_LCDDAT10                    _L_(53)      /**< LCDC signal: LCDC_LCDDAT10 on PB21 mux A */
#define MUX_PB21A_LCDC_LCDDAT10                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT10 */
#define PIO_PB21A_LCDC_LCDDAT10                    (_U_(1) << 21) /**< LCDC signal: LCDC_LCDDAT10 */
#define PIN_PC16A_LCDC_LCDDAT10                    _L_(80)      /**< LCDC signal: LCDC_LCDDAT10 on PC16 mux A */
#define MUX_PC16A_LCDC_LCDDAT10                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT10 */
#define PIO_PC16A_LCDC_LCDDAT10                    (_U_(1) << 16) /**< LCDC signal: LCDC_LCDDAT10 */
#define PIN_PB22A_LCDC_LCDDAT11                    _L_(54)      /**< LCDC signal: LCDC_LCDDAT11 on PB22 mux A */
#define MUX_PB22A_LCDC_LCDDAT11                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT11 */
#define PIO_PB22A_LCDC_LCDDAT11                    (_U_(1) << 22) /**< LCDC signal: LCDC_LCDDAT11 */
#define PIN_PC17A_LCDC_LCDDAT11                    _L_(81)      /**< LCDC signal: LCDC_LCDDAT11 on PC17 mux A */
#define MUX_PC17A_LCDC_LCDDAT11                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT11 */
#define PIO_PC17A_LCDC_LCDDAT11                    (_U_(1) << 17) /**< LCDC signal: LCDC_LCDDAT11 */
#define PIN_PB23A_LCDC_LCDDAT12                    _L_(55)      /**< LCDC signal: LCDC_LCDDAT12 on PB23 mux A */
#define MUX_PB23A_LCDC_LCDDAT12                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT12 */
#define PIO_PB23A_LCDC_LCDDAT12                    (_U_(1) << 23) /**< LCDC signal: LCDC_LCDDAT12 */
#define PIN_PC18A_LCDC_LCDDAT12                    _L_(82)      /**< LCDC signal: LCDC_LCDDAT12 on PC18 mux A */
#define MUX_PC18A_LCDC_LCDDAT12                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT12 */
#define PIO_PC18A_LCDC_LCDDAT12                    (_U_(1) << 18) /**< LCDC signal: LCDC_LCDDAT12 */
#define PIN_PB24A_LCDC_LCDDAT13                    _L_(56)      /**< LCDC signal: LCDC_LCDDAT13 on PB24 mux A */
#define MUX_PB24A_LCDC_LCDDAT13                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT13 */
#define PIO_PB24A_LCDC_LCDDAT13                    (_U_(1) << 24) /**< LCDC signal: LCDC_LCDDAT13 */
#define PIN_PC19A_LCDC_LCDDAT13                    _L_(83)      /**< LCDC signal: LCDC_LCDDAT13 on PC19 mux A */
#define MUX_PC19A_LCDC_LCDDAT13                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT13 */
#define PIO_PC19A_LCDC_LCDDAT13                    (_U_(1) << 19) /**< LCDC signal: LCDC_LCDDAT13 */
#define PIN_PB25A_LCDC_LCDDAT14                    _L_(57)      /**< LCDC signal: LCDC_LCDDAT14 on PB25 mux A */
#define MUX_PB25A_LCDC_LCDDAT14                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT14 */
#define PIO_PB25A_LCDC_LCDDAT14                    (_U_(1) << 25) /**< LCDC signal: LCDC_LCDDAT14 */
#define PIN_PC20A_LCDC_LCDDAT14                    _L_(84)      /**< LCDC signal: LCDC_LCDDAT14 on PC20 mux A */
#define MUX_PC20A_LCDC_LCDDAT14                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT14 */
#define PIO_PC20A_LCDC_LCDDAT14                    (_U_(1) << 20) /**< LCDC signal: LCDC_LCDDAT14 */
#define PIN_PB26A_LCDC_LCDDAT15                    _L_(58)      /**< LCDC signal: LCDC_LCDDAT15 on PB26 mux A */
#define MUX_PB26A_LCDC_LCDDAT15                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT15 */
#define PIO_PB26A_LCDC_LCDDAT15                    (_U_(1) << 26) /**< LCDC signal: LCDC_LCDDAT15 */
#define PIN_PC21A_LCDC_LCDDAT15                    _L_(85)      /**< LCDC signal: LCDC_LCDDAT15 on PC21 mux A */
#define MUX_PC21A_LCDC_LCDDAT15                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT15 */
#define PIO_PC21A_LCDC_LCDDAT15                    (_U_(1) << 21) /**< LCDC signal: LCDC_LCDDAT15 */
#define PIN_PB27A_LCDC_LCDDAT16                    _L_(59)      /**< LCDC signal: LCDC_LCDDAT16 on PB27 mux A */
#define MUX_PB27A_LCDC_LCDDAT16                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT16 */
#define PIO_PB27A_LCDC_LCDDAT16                    (_U_(1) << 27) /**< LCDC signal: LCDC_LCDDAT16 */
#define PIN_PB28A_LCDC_LCDDAT17                    _L_(60)      /**< LCDC signal: LCDC_LCDDAT17 on PB28 mux A */
#define MUX_PB28A_LCDC_LCDDAT17                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT17 */
#define PIO_PB28A_LCDC_LCDDAT17                    (_U_(1) << 28) /**< LCDC signal: LCDC_LCDDAT17 */
#define PIN_PB29A_LCDC_LCDDAT18                    _L_(61)      /**< LCDC signal: LCDC_LCDDAT18 on PB29 mux A */
#define MUX_PB29A_LCDC_LCDDAT18                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT18 */
#define PIO_PB29A_LCDC_LCDDAT18                    (_U_(1) << 29) /**< LCDC signal: LCDC_LCDDAT18 */
#define PIN_PC22A_LCDC_LCDDAT18                    _L_(86)      /**< LCDC signal: LCDC_LCDDAT18 on PC22 mux A */
#define MUX_PC22A_LCDC_LCDDAT18                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT18 */
#define PIO_PC22A_LCDC_LCDDAT18                    (_U_(1) << 22) /**< LCDC signal: LCDC_LCDDAT18 */
#define PIN_PB30A_LCDC_LCDDAT19                    _L_(62)      /**< LCDC signal: LCDC_LCDDAT19 on PB30 mux A */
#define MUX_PB30A_LCDC_LCDDAT19                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT19 */
#define PIO_PB30A_LCDC_LCDDAT19                    (_U_(1) << 30) /**< LCDC signal: LCDC_LCDDAT19 */
#define PIN_PC23A_LCDC_LCDDAT19                    _L_(87)      /**< LCDC signal: LCDC_LCDDAT19 on PC23 mux A */
#define MUX_PC23A_LCDC_LCDDAT19                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT19 */
#define PIO_PC23A_LCDC_LCDDAT19                    (_U_(1) << 23) /**< LCDC signal: LCDC_LCDDAT19 */
#define PIN_PB31A_LCDC_LCDDAT20                    _L_(63)      /**< LCDC signal: LCDC_LCDDAT20 on PB31 mux A */
#define MUX_PB31A_LCDC_LCDDAT20                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT20 */
#define PIO_PB31A_LCDC_LCDDAT20                    (_U_(1) << 31) /**< LCDC signal: LCDC_LCDDAT20 */
#define PIN_PC24A_LCDC_LCDDAT20                    _L_(88)      /**< LCDC signal: LCDC_LCDDAT20 on PC24 mux A */
#define MUX_PC24A_LCDC_LCDDAT20                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT20 */
#define PIO_PC24A_LCDC_LCDDAT20                    (_U_(1) << 24) /**< LCDC signal: LCDC_LCDDAT20 */
#define PIN_PC0A_LCDC_LCDDAT21                     _L_(64)      /**< LCDC signal: LCDC_LCDDAT21 on PC0 mux A */
#define MUX_PC0A_LCDC_LCDDAT21                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT21 */
#define PIO_PC0A_LCDC_LCDDAT21                     (_U_(1) << 0) /**< LCDC signal: LCDC_LCDDAT21 */
#define PIN_PC25A_LCDC_LCDDAT21                    _L_(89)      /**< LCDC signal: LCDC_LCDDAT21 on PC25 mux A */
#define MUX_PC25A_LCDC_LCDDAT21                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT21 */
#define PIO_PC25A_LCDC_LCDDAT21                    (_U_(1) << 25) /**< LCDC signal: LCDC_LCDDAT21 */
#define PIN_PC1A_LCDC_LCDDAT22                     _L_(65)      /**< LCDC signal: LCDC_LCDDAT22 on PC1 mux A */
#define MUX_PC1A_LCDC_LCDDAT22                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT22 */
#define PIO_PC1A_LCDC_LCDDAT22                     (_U_(1) << 1) /**< LCDC signal: LCDC_LCDDAT22 */
#define PIN_PC26A_LCDC_LCDDAT22                    _L_(90)      /**< LCDC signal: LCDC_LCDDAT22 on PC26 mux A */
#define MUX_PC26A_LCDC_LCDDAT22                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT22 */
#define PIO_PC26A_LCDC_LCDDAT22                    (_U_(1) << 26) /**< LCDC signal: LCDC_LCDDAT22 */
#define PIN_PC2A_LCDC_LCDDAT23                     _L_(66)      /**< LCDC signal: LCDC_LCDDAT23 on PC2 mux A */
#define MUX_PC2A_LCDC_LCDDAT23                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT23 */
#define PIO_PC2A_LCDC_LCDDAT23                     (_U_(1) << 2) /**< LCDC signal: LCDC_LCDDAT23 */
#define PIN_PC27A_LCDC_LCDDAT23                    _L_(91)      /**< LCDC signal: LCDC_LCDDAT23 on PC27 mux A */
#define MUX_PC27A_LCDC_LCDDAT23                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT23 */
#define PIO_PC27A_LCDC_LCDDAT23                    (_U_(1) << 27) /**< LCDC signal: LCDC_LCDDAT23 */
#define PIN_PC8A_LCDC_LCDDEN                       _L_(72)      /**< LCDC signal: LCDC_LCDDEN on PC8 mux A */
#define MUX_PC8A_LCDC_LCDDEN                       _L_(0)       /**< LCDC signal line function value: LCDC_LCDDEN */
#define PIO_PC8A_LCDC_LCDDEN                       (_U_(1) << 8) /**< LCDC signal: LCDC_LCDDEN */
#define PIN_PD1A_LCDC_LCDDEN                       _L_(97)      /**< LCDC signal: LCDC_LCDDEN on PD1 mux A */
#define MUX_PD1A_LCDC_LCDDEN                       _L_(0)       /**< LCDC signal line function value: LCDC_LCDDEN */
#define PIO_PD1A_LCDC_LCDDEN                       (_U_(1) << 1) /**< LCDC signal: LCDC_LCDDEN */
#define PIN_PC4A_LCDC_LCDDISP                      _L_(68)      /**< LCDC signal: LCDC_LCDDISP on PC4 mux A */
#define MUX_PC4A_LCDC_LCDDISP                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDDISP */
#define PIO_PC4A_LCDC_LCDDISP                      (_U_(1) << 4) /**< LCDC signal: LCDC_LCDDISP */
#define PIN_PC29A_LCDC_LCDDISP                     _L_(93)      /**< LCDC signal: LCDC_LCDDISP on PC29 mux A */
#define MUX_PC29A_LCDC_LCDDISP                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDISP */
#define PIO_PC29A_LCDC_LCDDISP                     (_U_(1) << 29) /**< LCDC signal: LCDC_LCDDISP */
#define PIN_PC6A_LCDC_LCDHSYNC                     _L_(70)      /**< LCDC signal: LCDC_LCDHSYNC on PC6 mux A */
#define MUX_PC6A_LCDC_LCDHSYNC                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDHSYNC */
#define PIO_PC6A_LCDC_LCDHSYNC                     (_U_(1) << 6) /**< LCDC signal: LCDC_LCDHSYNC */
#define PIN_PC31A_LCDC_LCDHSYNC                    _L_(95)      /**< LCDC signal: LCDC_LCDHSYNC on PC31 mux A */
#define MUX_PC31A_LCDC_LCDHSYNC                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDHSYNC */
#define PIO_PC31A_LCDC_LCDHSYNC                    (_U_(1) << 31) /**< LCDC signal: LCDC_LCDHSYNC */
#define PIN_PC7A_LCDC_LCDPCK                       _L_(71)      /**< LCDC signal: LCDC_LCDPCK on PC7 mux A */
#define MUX_PC7A_LCDC_LCDPCK                       _L_(0)       /**< LCDC signal line function value: LCDC_LCDPCK */
#define PIO_PC7A_LCDC_LCDPCK                       (_U_(1) << 7) /**< LCDC signal: LCDC_LCDPCK */
#define PIN_PD0A_LCDC_LCDPCK                       _L_(96)      /**< LCDC signal: LCDC_LCDPCK on PD0 mux A */
#define MUX_PD0A_LCDC_LCDPCK                       _L_(0)       /**< LCDC signal line function value: LCDC_LCDPCK */
#define PIO_PD0A_LCDC_LCDPCK                       (_U_(1) << 0) /**< LCDC signal: LCDC_LCDPCK */
#define PIN_PC3A_LCDC_LCDPWM                       _L_(67)      /**< LCDC signal: LCDC_LCDPWM on PC3 mux A */
#define MUX_PC3A_LCDC_LCDPWM                       _L_(0)       /**< LCDC signal line function value: LCDC_LCDPWM */
#define PIO_PC3A_LCDC_LCDPWM                       (_U_(1) << 3) /**< LCDC signal: LCDC_LCDPWM */
#define PIN_PC28A_LCDC_LCDPWM                      _L_(92)      /**< LCDC signal: LCDC_LCDPWM on PC28 mux A */
#define MUX_PC28A_LCDC_LCDPWM                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDPWM */
#define PIO_PC28A_LCDC_LCDPWM                      (_U_(1) << 28) /**< LCDC signal: LCDC_LCDPWM */
#define PIN_PC5A_LCDC_LCDVSYNC                     _L_(69)      /**< LCDC signal: LCDC_LCDVSYNC on PC5 mux A */
#define MUX_PC5A_LCDC_LCDVSYNC                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDVSYNC */
#define PIO_PC5A_LCDC_LCDVSYNC                     (_U_(1) << 5) /**< LCDC signal: LCDC_LCDVSYNC */
#define PIN_PC30A_LCDC_LCDVSYNC                    _L_(94)      /**< LCDC signal: LCDC_LCDVSYNC on PC30 mux A */
#define MUX_PC30A_LCDC_LCDVSYNC                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDVSYNC */
#define PIO_PC30A_LCDC_LCDVSYNC                    (_U_(1) << 30) /**< LCDC signal: LCDC_LCDVSYNC */
/* ========== PIO definition for MCAN0 peripheral ========== */
#define PIN_PC2C_MCAN0_CANRX0                      _L_(66)      /**< MCAN0 signal: MCAN0_CANRX0 on PC2 mux C */
#define MUX_PC2C_MCAN0_CANRX0                      _L_(2)       /**< MCAN0 signal line function value: MCAN0_CANRX0 */
#define PIO_PC2C_MCAN0_CANRX0                      (_U_(1) << 2) /**< MCAN0 signal: MCAN0_CANRX0 */
#define PIN_PC11E_MCAN0_CANRX0                     _L_(75)      /**< MCAN0 signal: MCAN0_CANRX0 on PC11 mux E */
#define MUX_PC11E_MCAN0_CANRX0                     _L_(4)       /**< MCAN0 signal line function value: MCAN0_CANRX0 */
#define PIO_PC11E_MCAN0_CANRX0                     (_U_(1) << 11) /**< MCAN0 signal: MCAN0_CANRX0 */
#define PIN_PC1C_MCAN0_CANTX0                      _L_(65)      /**< MCAN0 signal: MCAN0_CANTX0 on PC1 mux C */
#define MUX_PC1C_MCAN0_CANTX0                      _L_(2)       /**< MCAN0 signal line function value: MCAN0_CANTX0 */
