virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/pio/sama5d27.h
#define PIN_PA11F_SMC_A22                          _L_(11)      /**< SMC signal: SMC_A22 on PA11 mux F */
#define MUX_PA11F_SMC_A22                          _L_(5)       /**< SMC signal line function value: SMC_A22 */
#define PIO_PA11F_SMC_A22                          (_U_(1) << 11) /**< SMC signal: SMC_A22 */
#define PIN_PB1B_SMC_A22                           _L_(33)      /**< SMC signal: SMC_A22 on PB1 mux B */
#define MUX_PB1B_SMC_A22                           _L_(1)       /**< SMC signal line function value: SMC_A22 */
#define PIO_PB1B_SMC_A22                           (_U_(1) << 1) /**< SMC signal: SMC_A22 */
#define PIN_PA0F_SMC_D0                            _L_(0)       /**< SMC signal: SMC_D0 on PA0 mux F */
#define MUX_PA0F_SMC_D0                            _L_(5)       /**< SMC signal line function value: SMC_D0 */
#define PIO_PA0F_SMC_D0                            (_U_(1) << 0) /**< SMC signal: SMC_D0 */
#define PIN_PA22B_SMC_D0                           _L_(22)      /**< SMC signal: SMC_D0 on PA22 mux B */
#define MUX_PA22B_SMC_D0                           _L_(1)       /**< SMC signal line function value: SMC_D0 */
#define PIO_PA22B_SMC_D0                           (_U_(1) << 22) /**< SMC signal: SMC_D0 */
#define PIN_PA1F_SMC_D1                            _L_(1)       /**< SMC signal: SMC_D1 on PA1 mux F */
#define MUX_PA1F_SMC_D1                            _L_(5)       /**< SMC signal line function value: SMC_D1 */
#define PIO_PA1F_SMC_D1                            (_U_(1) << 1) /**< SMC signal: SMC_D1 */
#define PIN_PA23B_SMC_D1                           _L_(23)      /**< SMC signal: SMC_D1 on PA23 mux B */
#define MUX_PA23B_SMC_D1                           _L_(1)       /**< SMC signal line function value: SMC_D1 */
#define PIO_PA23B_SMC_D1                           (_U_(1) << 23) /**< SMC signal: SMC_D1 */
#define PIN_PA2F_SMC_D2                            _L_(2)       /**< SMC signal: SMC_D2 on PA2 mux F */
#define MUX_PA2F_SMC_D2                            _L_(5)       /**< SMC signal line function value: SMC_D2 */
#define PIO_PA2F_SMC_D2                            (_U_(1) << 2) /**< SMC signal: SMC_D2 */
#define PIN_PA24B_SMC_D2                           _L_(24)      /**< SMC signal: SMC_D2 on PA24 mux B */
#define MUX_PA24B_SMC_D2                           _L_(1)       /**< SMC signal line function value: SMC_D2 */
#define PIO_PA24B_SMC_D2                           (_U_(1) << 24) /**< SMC signal: SMC_D2 */
#define PIN_PA3F_SMC_D3                            _L_(3)       /**< SMC signal: SMC_D3 on PA3 mux F */
#define MUX_PA3F_SMC_D3                            _L_(5)       /**< SMC signal line function value: SMC_D3 */
#define PIO_PA3F_SMC_D3                            (_U_(1) << 3) /**< SMC signal: SMC_D3 */
#define PIN_PA25B_SMC_D3                           _L_(25)      /**< SMC signal: SMC_D3 on PA25 mux B */
#define MUX_PA25B_SMC_D3                           _L_(1)       /**< SMC signal line function value: SMC_D3 */
#define PIO_PA25B_SMC_D3                           (_U_(1) << 25) /**< SMC signal: SMC_D3 */
#define PIN_PA4F_SMC_D4                            _L_(4)       /**< SMC signal: SMC_D4 on PA4 mux F */
#define MUX_PA4F_SMC_D4                            _L_(5)       /**< SMC signal line function value: SMC_D4 */
#define PIO_PA4F_SMC_D4                            (_U_(1) << 4) /**< SMC signal: SMC_D4 */
#define PIN_PA26B_SMC_D4                           _L_(26)      /**< SMC signal: SMC_D4 on PA26 mux B */
#define MUX_PA26B_SMC_D4                           _L_(1)       /**< SMC signal line function value: SMC_D4 */
#define PIO_PA26B_SMC_D4                           (_U_(1) << 26) /**< SMC signal: SMC_D4 */
#define PIN_PA5F_SMC_D5                            _L_(5)       /**< SMC signal: SMC_D5 on PA5 mux F */
#define MUX_PA5F_SMC_D5                            _L_(5)       /**< SMC signal line function value: SMC_D5 */
#define PIO_PA5F_SMC_D5                            (_U_(1) << 5) /**< SMC signal: SMC_D5 */
#define PIN_PA27B_SMC_D5                           _L_(27)      /**< SMC signal: SMC_D5 on PA27 mux B */
#define MUX_PA27B_SMC_D5                           _L_(1)       /**< SMC signal line function value: SMC_D5 */
#define PIO_PA27B_SMC_D5                           (_U_(1) << 27) /**< SMC signal: SMC_D5 */
#define PIN_PA6F_SMC_D6                            _L_(6)       /**< SMC signal: SMC_D6 on PA6 mux F */
#define MUX_PA6F_SMC_D6                            _L_(5)       /**< SMC signal line function value: SMC_D6 */
#define PIO_PA6F_SMC_D6                            (_U_(1) << 6) /**< SMC signal: SMC_D6 */
#define PIN_PA28B_SMC_D6                           _L_(28)      /**< SMC signal: SMC_D6 on PA28 mux B */
#define MUX_PA28B_SMC_D6                           _L_(1)       /**< SMC signal line function value: SMC_D6 */
#define PIO_PA28B_SMC_D6                           (_U_(1) << 28) /**< SMC signal: SMC_D6 */
#define PIN_PA7F_SMC_D7                            _L_(7)       /**< SMC signal: SMC_D7 on PA7 mux F */
#define MUX_PA7F_SMC_D7                            _L_(5)       /**< SMC signal line function value: SMC_D7 */
#define PIO_PA7F_SMC_D7                            (_U_(1) << 7) /**< SMC signal: SMC_D7 */
#define PIN_PA29B_SMC_D7                           _L_(29)      /**< SMC signal: SMC_D7 on PA29 mux B */
#define MUX_PA29B_SMC_D7                           _L_(1)       /**< SMC signal line function value: SMC_D7 */
#define PIO_PA29B_SMC_D7                           (_U_(1) << 29) /**< SMC signal: SMC_D7 */
#define PIN_PA13F_SMC_D8                           _L_(13)      /**< SMC signal: SMC_D8 on PA13 mux F */
#define MUX_PA13F_SMC_D8                           _L_(5)       /**< SMC signal line function value: SMC_D8 */
#define PIO_PA13F_SMC_D8                           (_U_(1) << 13) /**< SMC signal: SMC_D8 */
#define PIN_PB3B_SMC_D8                            _L_(35)      /**< SMC signal: SMC_D8 on PB3 mux B */
#define MUX_PB3B_SMC_D8                            _L_(1)       /**< SMC signal line function value: SMC_D8 */
#define PIO_PB3B_SMC_D8                            (_U_(1) << 3) /**< SMC signal: SMC_D8 */
#define PIN_PA14F_SMC_D9                           _L_(14)      /**< SMC signal: SMC_D9 on PA14 mux F */
#define MUX_PA14F_SMC_D9                           _L_(5)       /**< SMC signal line function value: SMC_D9 */
#define PIO_PA14F_SMC_D9                           (_U_(1) << 14) /**< SMC signal: SMC_D9 */
#define PIN_PB4B_SMC_D9                            _L_(36)      /**< SMC signal: SMC_D9 on PB4 mux B */
#define MUX_PB4B_SMC_D9                            _L_(1)       /**< SMC signal line function value: SMC_D9 */
#define PIO_PB4B_SMC_D9                            (_U_(1) << 4) /**< SMC signal: SMC_D9 */
#define PIN_PA15F_SMC_D10                          _L_(15)      /**< SMC signal: SMC_D10 on PA15 mux F */
#define MUX_PA15F_SMC_D10                          _L_(5)       /**< SMC signal line function value: SMC_D10 */
#define PIO_PA15F_SMC_D10                          (_U_(1) << 15) /**< SMC signal: SMC_D10 */
#define PIN_PB5B_SMC_D10                           _L_(37)      /**< SMC signal: SMC_D10 on PB5 mux B */
#define MUX_PB5B_SMC_D10                           _L_(1)       /**< SMC signal line function value: SMC_D10 */
#define PIO_PB5B_SMC_D10                           (_U_(1) << 5) /**< SMC signal: SMC_D10 */
#define PIN_PA16F_SMC_D11                          _L_(16)      /**< SMC signal: SMC_D11 on PA16 mux F */
#define MUX_PA16F_SMC_D11                          _L_(5)       /**< SMC signal line function value: SMC_D11 */
#define PIO_PA16F_SMC_D11                          (_U_(1) << 16) /**< SMC signal: SMC_D11 */
#define PIN_PB6B_SMC_D11                           _L_(38)      /**< SMC signal: SMC_D11 on PB6 mux B */
#define MUX_PB6B_SMC_D11                           _L_(1)       /**< SMC signal line function value: SMC_D11 */
#define PIO_PB6B_SMC_D11                           (_U_(1) << 6) /**< SMC signal: SMC_D11 */
#define PIN_PA17F_SMC_D12                          _L_(17)      /**< SMC signal: SMC_D12 on PA17 mux F */
#define MUX_PA17F_SMC_D12                          _L_(5)       /**< SMC signal line function value: SMC_D12 */
#define PIO_PA17F_SMC_D12                          (_U_(1) << 17) /**< SMC signal: SMC_D12 */
#define PIN_PB7B_SMC_D12                           _L_(39)      /**< SMC signal: SMC_D12 on PB7 mux B */
#define MUX_PB7B_SMC_D12                           _L_(1)       /**< SMC signal line function value: SMC_D12 */
#define PIO_PB7B_SMC_D12                           (_U_(1) << 7) /**< SMC signal: SMC_D12 */
#define PIN_PA18F_SMC_D13                          _L_(18)      /**< SMC signal: SMC_D13 on PA18 mux F */
#define MUX_PA18F_SMC_D13                          _L_(5)       /**< SMC signal line function value: SMC_D13 */
#define PIO_PA18F_SMC_D13                          (_U_(1) << 18) /**< SMC signal: SMC_D13 */
#define PIN_PB8B_SMC_D13                           _L_(40)      /**< SMC signal: SMC_D13 on PB8 mux B */
#define MUX_PB8B_SMC_D13                           _L_(1)       /**< SMC signal line function value: SMC_D13 */
#define PIO_PB8B_SMC_D13                           (_U_(1) << 8) /**< SMC signal: SMC_D13 */
#define PIN_PA19F_SMC_D14                          _L_(19)      /**< SMC signal: SMC_D14 on PA19 mux F */
#define MUX_PA19F_SMC_D14                          _L_(5)       /**< SMC signal line function value: SMC_D14 */
#define PIO_PA19F_SMC_D14                          (_U_(1) << 19) /**< SMC signal: SMC_D14 */
#define PIN_PB9B_SMC_D14                           _L_(41)      /**< SMC signal: SMC_D14 on PB9 mux B */
#define MUX_PB9B_SMC_D14                           _L_(1)       /**< SMC signal line function value: SMC_D14 */
#define PIO_PB9B_SMC_D14                           (_U_(1) << 9) /**< SMC signal: SMC_D14 */
#define PIN_PA20F_SMC_D15                          _L_(20)      /**< SMC signal: SMC_D15 on PA20 mux F */
#define MUX_PA20F_SMC_D15                          _L_(5)       /**< SMC signal line function value: SMC_D15 */
#define PIO_PA20F_SMC_D15                          (_U_(1) << 20) /**< SMC signal: SMC_D15 */
#define PIN_PB10B_SMC_D15                          _L_(42)      /**< SMC signal: SMC_D15 on PB10 mux B */
#define MUX_PB10B_SMC_D15                          _L_(1)       /**< SMC signal line function value: SMC_D15 */
#define PIO_PB10B_SMC_D15                          (_U_(1) << 10) /**< SMC signal: SMC_D15 */
#define PIN_PA8F_SMC_NANDNWE                       _L_(8)       /**< SMC signal: SMC_NANDNWE on PA8 mux F */
#define MUX_PA8F_SMC_NANDNWE                       _L_(5)       /**< SMC signal line function value: SMC_NANDNWE */
#define PIO_PA8F_SMC_NANDNWE                       (_U_(1) << 8) /**< SMC signal: SMC_NANDNWE */
#define PIN_PA30B_SMC_NANDNWE                      _L_(30)      /**< SMC signal: SMC_NANDNWE on PA30 mux B */
#define MUX_PA30B_SMC_NANDNWE                      _L_(1)       /**< SMC signal line function value: SMC_NANDNWE */
#define PIO_PA30B_SMC_NANDNWE                      (_U_(1) << 30) /**< SMC signal: SMC_NANDNWE */
#define PIN_PA12F_SMC_NANDOE                       _L_(12)      /**< SMC signal: SMC_NANDOE on PA12 mux F */
#define MUX_PA12F_SMC_NANDOE                       _L_(5)       /**< SMC signal line function value: SMC_NANDOE */
#define PIO_PA12F_SMC_NANDOE                       (_U_(1) << 12) /**< SMC signal: SMC_NANDOE */
#define PIN_PB2B_SMC_NANDOE                        _L_(34)      /**< SMC signal: SMC_NANDOE on PB2 mux B */
#define MUX_PB2B_SMC_NANDOE                        _L_(1)       /**< SMC signal line function value: SMC_NANDOE */
#define PIO_PB2B_SMC_NANDOE                        (_U_(1) << 2) /**< SMC signal: SMC_NANDOE */
#define PIN_PA21F_SMC_NANDRDY                      _L_(21)      /**< SMC signal: SMC_NANDRDY on PA21 mux F */
#define MUX_PA21F_SMC_NANDRDY                      _L_(5)       /**< SMC signal line function value: SMC_NANDRDY */
#define PIO_PA21F_SMC_NANDRDY                      (_U_(1) << 21) /**< SMC signal: SMC_NANDRDY */
#define PIN_PC8B_SMC_NANDRDY                       _L_(72)      /**< SMC signal: SMC_NANDRDY on PC8 mux B */
#define MUX_PC8B_SMC_NANDRDY                       _L_(1)       /**< SMC signal line function value: SMC_NANDRDY */
#define PIO_PC8B_SMC_NANDRDY                       (_U_(1) << 8) /**< SMC signal: SMC_NANDRDY */
#define PIN_PD8F_SMC_NANDRDY                       _L_(104)     /**< SMC signal: SMC_NANDRDY on PD8 mux F */
#define MUX_PD8F_SMC_NANDRDY                       _L_(5)       /**< SMC signal line function value: SMC_NANDRDY */
#define PIO_PD8F_SMC_NANDRDY                       (_U_(1) << 8) /**< SMC signal: SMC_NANDRDY */
#define PIN_PC5B_SMC_NCS0                          _L_(69)      /**< SMC signal: SMC_NCS0 on PC5 mux B */
#define MUX_PC5B_SMC_NCS0                          _L_(1)       /**< SMC signal line function value: SMC_NCS0 */
#define PIO_PC5B_SMC_NCS0                          (_U_(1) << 5) /**< SMC signal: SMC_NCS0 */
#define PIN_PD4F_SMC_NCS0                          _L_(100)     /**< SMC signal: SMC_NCS0 on PD4 mux F */
#define MUX_PD4F_SMC_NCS0                          _L_(5)       /**< SMC signal line function value: SMC_NCS0 */
#define PIO_PD4F_SMC_NCS0                          (_U_(1) << 4) /**< SMC signal: SMC_NCS0 */
#define PIN_PD5F_SMC_NCS1                          _L_(101)     /**< SMC signal: SMC_NCS1 on PD5 mux F */
#define MUX_PD5F_SMC_NCS1                          _L_(5)       /**< SMC signal line function value: SMC_NCS1 */
#define PIO_PD5F_SMC_NCS1                          (_U_(1) << 5) /**< SMC signal: SMC_NCS1 */
#define PIN_PC7B_SMC_NCS2                          _L_(71)      /**< SMC signal: SMC_NCS2 on PC7 mux B */
#define MUX_PC7B_SMC_NCS2                          _L_(1)       /**< SMC signal line function value: SMC_NCS2 */
#define PIO_PC7B_SMC_NCS2                          (_U_(1) << 7) /**< SMC signal: SMC_NCS2 */
#define PIN_PD6F_SMC_NCS2                          _L_(102)     /**< SMC signal: SMC_NCS2 on PD6 mux F */
#define MUX_PD6F_SMC_NCS2                          _L_(5)       /**< SMC signal line function value: SMC_NCS2 */
#define PIO_PD6F_SMC_NCS2                          (_U_(1) << 6) /**< SMC signal: SMC_NCS2 */
#define PIN_PA9F_SMC_NCS3                          _L_(9)       /**< SMC signal: SMC_NCS3 on PA9 mux F */
#define MUX_PA9F_SMC_NCS3                          _L_(5)       /**< SMC signal line function value: SMC_NCS3 */
#define PIO_PA9F_SMC_NCS3                          (_U_(1) << 9) /**< SMC signal: SMC_NCS3 */
#define PIN_PA31B_SMC_NCS3                         _L_(31)      /**< SMC signal: SMC_NCS3 on PA31 mux B */
#define MUX_PA31B_SMC_NCS3                         _L_(1)       /**< SMC signal line function value: SMC_NCS3 */
#define PIO_PA31B_SMC_NCS3                         (_U_(1) << 31) /**< SMC signal: SMC_NCS3 */
#define PIN_PC3B_SMC_NWAIT                         _L_(67)      /**< SMC signal: SMC_NWAIT on PC3 mux B */
#define MUX_PC3B_SMC_NWAIT                         _L_(1)       /**< SMC signal line function value: SMC_NWAIT */
#define PIO_PC3B_SMC_NWAIT                         (_U_(1) << 3) /**< SMC signal: SMC_NWAIT */
#define PIN_PD3F_SMC_NWAIT                         _L_(99)      /**< SMC signal: SMC_NWAIT on PD3 mux F */
#define MUX_PD3F_SMC_NWAIT                         _L_(5)       /**< SMC signal line function value: SMC_NWAIT */
#define PIO_PD3F_SMC_NWAIT                         (_U_(1) << 3) /**< SMC signal: SMC_NWAIT */
#define PIN_PC4B_SMC_NWR1                          _L_(68)      /**< SMC signal: SMC_NWR1 on PC4 mux B */
#define MUX_PC4B_SMC_NWR1                          _L_(1)       /**< SMC signal line function value: SMC_NWR1 */
#define PIO_PC4B_SMC_NWR1                          (_U_(1) << 4) /**< SMC signal: SMC_NWR1 */
#define PIN_PD7F_SMC_NWR1                          _L_(103)     /**< SMC signal: SMC_NWR1 on PD7 mux F */
#define MUX_PD7F_SMC_NWR1                          _L_(5)       /**< SMC signal line function value: SMC_NWR1 */
#define PIO_PD7F_SMC_NWR1                          (_U_(1) << 7) /**< SMC signal: SMC_NWR1 */
/* ========== PIO definition for SPI0 peripheral ========== */
#define PIN_PA16A_SPI0_MISO                        _L_(16)      /**< SPI0 signal: SPI0_MISO on PA16 mux A */
#define MUX_PA16A_SPI0_MISO                        _L_(0)       /**< SPI0 signal line function value: SPI0_MISO */
#define PIO_PA16A_SPI0_MISO                        (_U_(1) << 16) /**< SPI0 signal: SPI0_MISO */
#define PIN_PA31C_SPI0_MISO                        _L_(31)      /**< SPI0 signal: SPI0_MISO on PA31 mux C */
#define MUX_PA31C_SPI0_MISO                        _L_(2)       /**< SPI0 signal line function value: SPI0_MISO */
#define PIO_PA31C_SPI0_MISO                        (_U_(1) << 31) /**< SPI0 signal: SPI0_MISO */
#define PIN_PA15A_SPI0_MOSI                        _L_(15)      /**< SPI0 signal: SPI0_MOSI on PA15 mux A */
#define MUX_PA15A_SPI0_MOSI                        _L_(0)       /**< SPI0 signal line function value: SPI0_MOSI */
#define PIO_PA15A_SPI0_MOSI                        (_U_(1) << 15) /**< SPI0 signal: SPI0_MOSI */
#define PIN_PB0C_SPI0_MOSI                         _L_(32)      /**< SPI0 signal: SPI0_MOSI on PB0 mux C */
#define MUX_PB0C_SPI0_MOSI                         _L_(2)       /**< SPI0 signal line function value: SPI0_MOSI */
#define PIO_PB0C_SPI0_MOSI                         (_U_(1) << 0) /**< SPI0 signal: SPI0_MOSI */
#define PIN_PA17A_SPI0_NPCS0                       _L_(17)      /**< SPI0 signal: SPI0_NPCS0 on PA17 mux A */
#define MUX_PA17A_SPI0_NPCS0                       _L_(0)       /**< SPI0 signal line function value: SPI0_NPCS0 */
#define PIO_PA17A_SPI0_NPCS0                       (_U_(1) << 17) /**< SPI0 signal: SPI0_NPCS0 */
#define PIN_PA30C_SPI0_NPCS0                       _L_(30)      /**< SPI0 signal: SPI0_NPCS0 on PA30 mux C */
#define MUX_PA30C_SPI0_NPCS0                       _L_(2)       /**< SPI0 signal line function value: SPI0_NPCS0 */
#define PIO_PA30C_SPI0_NPCS0                       (_U_(1) << 30) /**< SPI0 signal: SPI0_NPCS0 */
#define PIN_PA18A_SPI0_NPCS1                       _L_(18)      /**< SPI0 signal: SPI0_NPCS1 on PA18 mux A */
#define MUX_PA18A_SPI0_NPCS1                       _L_(0)       /**< SPI0 signal line function value: SPI0_NPCS1 */
#define PIO_PA18A_SPI0_NPCS1                       (_U_(1) << 18) /**< SPI0 signal: SPI0_NPCS1 */
#define PIN_PA29C_SPI0_NPCS1                       _L_(29)      /**< SPI0 signal: SPI0_NPCS1 on PA29 mux C */
#define MUX_PA29C_SPI0_NPCS1                       _L_(2)       /**< SPI0 signal line function value: SPI0_NPCS1 */
#define PIO_PA29C_SPI0_NPCS1                       (_U_(1) << 29) /**< SPI0 signal: SPI0_NPCS1 */
#define PIN_PA19A_SPI0_NPCS2                       _L_(19)      /**< SPI0 signal: SPI0_NPCS2 on PA19 mux A */
#define MUX_PA19A_SPI0_NPCS2                       _L_(0)       /**< SPI0 signal line function value: SPI0_NPCS2 */
#define PIO_PA19A_SPI0_NPCS2                       (_U_(1) << 19) /**< SPI0 signal: SPI0_NPCS2 */
#define PIN_PA27C_SPI0_NPCS2                       _L_(27)      /**< SPI0 signal: SPI0_NPCS2 on PA27 mux C */
#define MUX_PA27C_SPI0_NPCS2                       _L_(2)       /**< SPI0 signal line function value: SPI0_NPCS2 */
#define PIO_PA27C_SPI0_NPCS2                       (_U_(1) << 27) /**< SPI0 signal: SPI0_NPCS2 */
#define PIN_PA20A_SPI0_NPCS3                       _L_(20)      /**< SPI0 signal: SPI0_NPCS3 on PA20 mux A */
#define MUX_PA20A_SPI0_NPCS3                       _L_(0)       /**< SPI0 signal line function value: SPI0_NPCS3 */
#define PIO_PA20A_SPI0_NPCS3                       (_U_(1) << 20) /**< SPI0 signal: SPI0_NPCS3 */
#define PIN_PA28C_SPI0_NPCS3                       _L_(28)      /**< SPI0 signal: SPI0_NPCS3 on PA28 mux C */
#define MUX_PA28C_SPI0_NPCS3                       _L_(2)       /**< SPI0 signal line function value: SPI0_NPCS3 */
#define PIO_PA28C_SPI0_NPCS3                       (_U_(1) << 28) /**< SPI0 signal: SPI0_NPCS3 */
#define PIN_PA14A_SPI0_SPCK                        _L_(14)      /**< SPI0 signal: SPI0_SPCK on PA14 mux A */
#define MUX_PA14A_SPI0_SPCK                        _L_(0)       /**< SPI0 signal line function value: SPI0_SPCK */
#define PIO_PA14A_SPI0_SPCK                        (_U_(1) << 14) /**< SPI0 signal: SPI0_SPCK */
#define PIN_PB1C_SPI0_SPCK                         _L_(33)      /**< SPI0 signal: SPI0_SPCK on PB1 mux C */
#define MUX_PB1C_SPI0_SPCK                         _L_(2)       /**< SPI0 signal line function value: SPI0_SPCK */
#define PIO_PB1C_SPI0_SPCK                         (_U_(1) << 1) /**< SPI0 signal: SPI0_SPCK */
/* ========== PIO definition for SPI1 peripheral ========== */
#define PIN_PA24D_SPI1_MISO                        _L_(24)      /**< SPI1 signal: SPI1_MISO on PA24 mux D */
#define MUX_PA24D_SPI1_MISO                        _L_(3)       /**< SPI1 signal line function value: SPI1_MISO */
#define PIO_PA24D_SPI1_MISO                        (_U_(1) << 24) /**< SPI1 signal: SPI1_MISO */
#define PIN_PC3D_SPI1_MISO                         _L_(67)      /**< SPI1 signal: SPI1_MISO on PC3 mux D */
#define MUX_PC3D_SPI1_MISO                         _L_(3)       /**< SPI1 signal line function value: SPI1_MISO */
#define PIO_PC3D_SPI1_MISO                         (_U_(1) << 3) /**< SPI1 signal: SPI1_MISO */
#define PIN_PD27A_SPI1_MISO                        _L_(123)     /**< SPI1 signal: SPI1_MISO on PD27 mux A */
#define MUX_PD27A_SPI1_MISO                        _L_(0)       /**< SPI1 signal line function value: SPI1_MISO */
#define PIO_PD27A_SPI1_MISO                        (_U_(1) << 27) /**< SPI1 signal: SPI1_MISO */
#define PIN_PA23D_SPI1_MOSI                        _L_(23)      /**< SPI1 signal: SPI1_MOSI on PA23 mux D */
#define MUX_PA23D_SPI1_MOSI                        _L_(3)       /**< SPI1 signal line function value: SPI1_MOSI */
#define PIO_PA23D_SPI1_MOSI                        (_U_(1) << 23) /**< SPI1 signal: SPI1_MOSI */
#define PIN_PC2D_SPI1_MOSI                         _L_(66)      /**< SPI1 signal: SPI1_MOSI on PC2 mux D */
#define MUX_PC2D_SPI1_MOSI                         _L_(3)       /**< SPI1 signal line function value: SPI1_MOSI */
#define PIO_PC2D_SPI1_MOSI                         (_U_(1) << 2) /**< SPI1 signal: SPI1_MOSI */
#define PIN_PD26A_SPI1_MOSI                        _L_(122)     /**< SPI1 signal: SPI1_MOSI on PD26 mux A */
#define MUX_PD26A_SPI1_MOSI                        _L_(0)       /**< SPI1 signal line function value: SPI1_MOSI */
#define PIO_PD26A_SPI1_MOSI                        (_U_(1) << 26) /**< SPI1 signal: SPI1_MOSI */
#define PIN_PA25D_SPI1_NPCS0                       _L_(25)      /**< SPI1 signal: SPI1_NPCS0 on PA25 mux D */
#define MUX_PA25D_SPI1_NPCS0                       _L_(3)       /**< SPI1 signal line function value: SPI1_NPCS0 */
#define PIO_PA25D_SPI1_NPCS0                       (_U_(1) << 25) /**< SPI1 signal: SPI1_NPCS0 */
#define PIN_PC4D_SPI1_NPCS0                        _L_(68)      /**< SPI1 signal: SPI1_NPCS0 on PC4 mux D */
#define MUX_PC4D_SPI1_NPCS0                        _L_(3)       /**< SPI1 signal line function value: SPI1_NPCS0 */
#define PIO_PC4D_SPI1_NPCS0                        (_U_(1) << 4) /**< SPI1 signal: SPI1_NPCS0 */
#define PIN_PD28A_SPI1_NPCS0                       _L_(124)     /**< SPI1 signal: SPI1_NPCS0 on PD28 mux A */
#define MUX_PD28A_SPI1_NPCS0                       _L_(0)       /**< SPI1 signal line function value: SPI1_NPCS0 */
#define PIO_PD28A_SPI1_NPCS0                       (_U_(1) << 28) /**< SPI1 signal: SPI1_NPCS0 */
#define PIN_PA26D_SPI1_NPCS1                       _L_(26)      /**< SPI1 signal: SPI1_NPCS1 on PA26 mux D */
#define MUX_PA26D_SPI1_NPCS1                       _L_(3)       /**< SPI1 signal line function value: SPI1_NPCS1 */
