virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/pio/sama5d27.h
#define PIN_PA7D_TC1_TIOB5                         _L_(7)       /**< TC1 signal: TC1_TIOB5 on PA7 mux D */
#define MUX_PA7D_TC1_TIOB5                         _L_(3)       /**< TC1 signal line function value: TC1_TIOB5 */
#define PIO_PA7D_TC1_TIOB5                         (_U_(1) << 7) /**< TC1 signal: TC1_TIOB5 */
#define PIN_PB29D_TC1_TIOB5                        _L_(61)      /**< TC1 signal: TC1_TIOB5 on PB29 mux D */
#define MUX_PB29D_TC1_TIOB5                        _L_(3)       /**< TC1 signal line function value: TC1_TIOB5 */
#define PIO_PB29D_TC1_TIOB5                        (_U_(1) << 29) /**< TC1 signal: TC1_TIOB5 */
/* ========== PIO definition for TWIHS0 peripheral ========== */
#define PIN_PC0D_TWIHS0_TWCK0                      _L_(64)      /**< TWIHS0 signal: TWIHS0_TWCK0 on PC0 mux D */
#define MUX_PC0D_TWIHS0_TWCK0                      _L_(3)       /**< TWIHS0 signal line function value: TWIHS0_TWCK0 */
#define PIO_PC0D_TWIHS0_TWCK0                      (_U_(1) << 0) /**< TWIHS0 signal: TWIHS0_TWCK0 */
#define PIN_PC28E_TWIHS0_TWCK0                     _L_(92)      /**< TWIHS0 signal: TWIHS0_TWCK0 on PC28 mux E */
#define MUX_PC28E_TWIHS0_TWCK0                     _L_(4)       /**< TWIHS0 signal line function value: TWIHS0_TWCK0 */
#define PIO_PC28E_TWIHS0_TWCK0                     (_U_(1) << 28) /**< TWIHS0 signal: TWIHS0_TWCK0 */
#define PIN_PD22B_TWIHS0_TWCK0                     _L_(118)     /**< TWIHS0 signal: TWIHS0_TWCK0 on PD22 mux B */
#define MUX_PD22B_TWIHS0_TWCK0                     _L_(1)       /**< TWIHS0 signal line function value: TWIHS0_TWCK0 */
#define PIO_PD22B_TWIHS0_TWCK0                     (_U_(1) << 22) /**< TWIHS0 signal: TWIHS0_TWCK0 */
#define PIN_PD30E_TWIHS0_TWCK0                     _L_(126)     /**< TWIHS0 signal: TWIHS0_TWCK0 on PD30 mux E */
#define MUX_PD30E_TWIHS0_TWCK0                     _L_(4)       /**< TWIHS0 signal line function value: TWIHS0_TWCK0 */
#define PIO_PD30E_TWIHS0_TWCK0                     (_U_(1) << 30) /**< TWIHS0 signal: TWIHS0_TWCK0 */
#define PIN_PB31D_TWIHS0_TWD0                      _L_(63)      /**< TWIHS0 signal: TWIHS0_TWD0 on PB31 mux D */
#define MUX_PB31D_TWIHS0_TWD0                      _L_(3)       /**< TWIHS0 signal line function value: TWIHS0_TWD0 */
#define PIO_PB31D_TWIHS0_TWD0                      (_U_(1) << 31) /**< TWIHS0 signal: TWIHS0_TWD0 */
#define PIN_PC27E_TWIHS0_TWD0                      _L_(91)      /**< TWIHS0 signal: TWIHS0_TWD0 on PC27 mux E */
#define MUX_PC27E_TWIHS0_TWD0                      _L_(4)       /**< TWIHS0 signal line function value: TWIHS0_TWD0 */
#define PIO_PC27E_TWIHS0_TWD0                      (_U_(1) << 27) /**< TWIHS0 signal: TWIHS0_TWD0 */
#define PIN_PD21B_TWIHS0_TWD0                      _L_(117)     /**< TWIHS0 signal: TWIHS0_TWD0 on PD21 mux B */
#define MUX_PD21B_TWIHS0_TWD0                      _L_(1)       /**< TWIHS0 signal line function value: TWIHS0_TWD0 */
#define PIO_PD21B_TWIHS0_TWD0                      (_U_(1) << 21) /**< TWIHS0 signal: TWIHS0_TWD0 */
#define PIN_PD29E_TWIHS0_TWD0                      _L_(125)     /**< TWIHS0 signal: TWIHS0_TWD0 on PD29 mux E */
#define MUX_PD29E_TWIHS0_TWD0                      _L_(4)       /**< TWIHS0 signal line function value: TWIHS0_TWD0 */
#define PIO_PD29E_TWIHS0_TWD0                      (_U_(1) << 29) /**< TWIHS0 signal: TWIHS0_TWD0 */
/* ========== PIO definition for TWIHS1 peripheral ========== */
#define PIN_PC7C_TWIHS1_TWCK1                      _L_(71)      /**< TWIHS1 signal: TWIHS1_TWCK1 on PC7 mux C */
#define MUX_PC7C_TWIHS1_TWCK1                      _L_(2)       /**< TWIHS1 signal line function value: TWIHS1_TWCK1 */
#define PIO_PC7C_TWIHS1_TWCK1                      (_U_(1) << 7) /**< TWIHS1 signal: TWIHS1_TWCK1 */
#define PIN_PD5A_TWIHS1_TWCK1                      _L_(101)     /**< TWIHS1 signal: TWIHS1_TWCK1 on PD5 mux A */
#define MUX_PD5A_TWIHS1_TWCK1                      _L_(0)       /**< TWIHS1 signal line function value: TWIHS1_TWCK1 */
#define PIO_PD5A_TWIHS1_TWCK1                      (_U_(1) << 5) /**< TWIHS1 signal: TWIHS1_TWCK1 */
#define PIN_PD20B_TWIHS1_TWCK1                     _L_(116)     /**< TWIHS1 signal: TWIHS1_TWCK1 on PD20 mux B */
#define MUX_PD20B_TWIHS1_TWCK1                     _L_(1)       /**< TWIHS1 signal line function value: TWIHS1_TWCK1 */
#define PIO_PD20B_TWIHS1_TWCK1                     (_U_(1) << 20) /**< TWIHS1 signal: TWIHS1_TWCK1 */
#define PIN_PC6C_TWIHS1_TWD1                       _L_(70)      /**< TWIHS1 signal: TWIHS1_TWD1 on PC6 mux C */
#define MUX_PC6C_TWIHS1_TWD1                       _L_(2)       /**< TWIHS1 signal line function value: TWIHS1_TWD1 */
#define PIO_PC6C_TWIHS1_TWD1                       (_U_(1) << 6) /**< TWIHS1 signal: TWIHS1_TWD1 */
#define PIN_PD4A_TWIHS1_TWD1                       _L_(100)     /**< TWIHS1 signal: TWIHS1_TWD1 on PD4 mux A */
#define MUX_PD4A_TWIHS1_TWD1                       _L_(0)       /**< TWIHS1 signal line function value: TWIHS1_TWD1 */
#define PIO_PD4A_TWIHS1_TWD1                       (_U_(1) << 4) /**< TWIHS1 signal: TWIHS1_TWD1 */
#define PIN_PD19B_TWIHS1_TWD1                      _L_(115)     /**< TWIHS1 signal: TWIHS1_TWD1 on PD19 mux B */
#define MUX_PD19B_TWIHS1_TWD1                      _L_(1)       /**< TWIHS1 signal line function value: TWIHS1_TWD1 */
#define PIO_PD19B_TWIHS1_TWD1                      (_U_(1) << 19) /**< TWIHS1 signal: TWIHS1_TWD1 */
/* ========== PIO definition for UART0 peripheral ========== */
#define PIN_PB26C_UART0_URXD0                      _L_(58)      /**< UART0 signal: UART0_URXD0 on PB26 mux C */
#define MUX_PB26C_UART0_URXD0                      _L_(2)       /**< UART0 signal line function value: UART0_URXD0 */
#define PIO_PB26C_UART0_URXD0                      (_U_(1) << 26) /**< UART0 signal: UART0_URXD0 */
#define PIN_PB27C_UART0_UTXD0                      _L_(59)      /**< UART0 signal: UART0_UTXD0 on PB27 mux C */
#define MUX_PB27C_UART0_UTXD0                      _L_(2)       /**< UART0 signal line function value: UART0_UTXD0 */
#define PIO_PB27C_UART0_UTXD0                      (_U_(1) << 27) /**< UART0 signal: UART0_UTXD0 */
/* ========== PIO definition for UART1 peripheral ========== */
#define PIN_PC7E_UART1_URXD1                       _L_(71)      /**< UART1 signal: UART1_URXD1 on PC7 mux E */
#define MUX_PC7E_UART1_URXD1                       _L_(4)       /**< UART1 signal line function value: UART1_URXD1 */
#define PIO_PC7E_UART1_URXD1                       (_U_(1) << 7) /**< UART1 signal: UART1_URXD1 */
#define PIN_PD2A_UART1_URXD1                       _L_(98)      /**< UART1 signal: UART1_URXD1 on PD2 mux A */
#define MUX_PD2A_UART1_URXD1                       _L_(0)       /**< UART1 signal line function value: UART1_URXD1 */
#define PIO_PD2A_UART1_URXD1                       (_U_(1) << 2) /**< UART1 signal: UART1_URXD1 */
#define PIN_PC8E_UART1_UTXD1                       _L_(72)      /**< UART1 signal: UART1_UTXD1 on PC8 mux E */
#define MUX_PC8E_UART1_UTXD1                       _L_(4)       /**< UART1 signal line function value: UART1_UTXD1 */
#define PIO_PC8E_UART1_UTXD1                       (_U_(1) << 8) /**< UART1 signal: UART1_UTXD1 */
#define PIN_PD3A_UART1_UTXD1                       _L_(99)      /**< UART1 signal: UART1_UTXD1 on PD3 mux A */
#define MUX_PD3A_UART1_UTXD1                       _L_(0)       /**< UART1 signal line function value: UART1_UTXD1 */
#define PIO_PD3A_UART1_UTXD1                       (_U_(1) << 3) /**< UART1 signal: UART1_UTXD1 */
/* ========== PIO definition for UART2 peripheral ========== */
#define PIN_PD4B_UART2_URXD2                       _L_(100)     /**< UART2 signal: UART2_URXD2 on PD4 mux B */
#define MUX_PD4B_UART2_URXD2                       _L_(1)       /**< UART2 signal line function value: UART2_URXD2 */
#define PIO_PD4B_UART2_URXD2                       (_U_(1) << 4) /**< UART2 signal: UART2_URXD2 */
#define PIN_PD19C_UART2_URXD2                      _L_(115)     /**< UART2 signal: UART2_URXD2 on PD19 mux C */
#define MUX_PD19C_UART2_URXD2                      _L_(2)       /**< UART2 signal line function value: UART2_URXD2 */
#define PIO_PD19C_UART2_URXD2                      (_U_(1) << 19) /**< UART2 signal: UART2_URXD2 */
#define PIN_PD23A_UART2_URXD2                      _L_(119)     /**< UART2 signal: UART2_URXD2 on PD23 mux A */
#define MUX_PD23A_UART2_URXD2                      _L_(0)       /**< UART2 signal line function value: UART2_URXD2 */
#define PIO_PD23A_UART2_URXD2                      (_U_(1) << 23) /**< UART2 signal: UART2_URXD2 */
#define PIN_PD5B_UART2_UTXD2                       _L_(101)     /**< UART2 signal: UART2_UTXD2 on PD5 mux B */
#define MUX_PD5B_UART2_UTXD2                       _L_(1)       /**< UART2 signal line function value: UART2_UTXD2 */
#define PIO_PD5B_UART2_UTXD2                       (_U_(1) << 5) /**< UART2 signal: UART2_UTXD2 */
#define PIN_PD20C_UART2_UTXD2                      _L_(116)     /**< UART2 signal: UART2_UTXD2 on PD20 mux C */
#define MUX_PD20C_UART2_UTXD2                      _L_(2)       /**< UART2 signal line function value: UART2_UTXD2 */
#define PIO_PD20C_UART2_UTXD2                      (_U_(1) << 20) /**< UART2 signal: UART2_UTXD2 */
#define PIN_PD24A_UART2_UTXD2                      _L_(120)     /**< UART2 signal: UART2_UTXD2 on PD24 mux A */
#define MUX_PD24A_UART2_UTXD2                      _L_(0)       /**< UART2 signal line function value: UART2_UTXD2 */
#define PIO_PD24A_UART2_UTXD2                      (_U_(1) << 24) /**< UART2 signal: UART2_UTXD2 */
/* ========== PIO definition for UART3 peripheral ========== */
#define PIN_PB11C_UART3_URXD3                      _L_(43)      /**< UART3 signal: UART3_URXD3 on PB11 mux C */
#define MUX_PB11C_UART3_URXD3                      _L_(2)       /**< UART3 signal line function value: UART3_URXD3 */
#define PIO_PB11C_UART3_URXD3                      (_U_(1) << 11) /**< UART3 signal: UART3_URXD3 */
#define PIN_PC12D_UART3_URXD3                      _L_(76)      /**< UART3 signal: UART3_URXD3 on PC12 mux D */
#define MUX_PC12D_UART3_URXD3                      _L_(3)       /**< UART3 signal line function value: UART3_URXD3 */
#define PIO_PC12D_UART3_URXD3                      (_U_(1) << 12) /**< UART3 signal: UART3_URXD3 */
#define PIN_PC31C_UART3_URXD3                      _L_(95)      /**< UART3 signal: UART3_URXD3 on PC31 mux C */
#define MUX_PC31C_UART3_URXD3                      _L_(2)       /**< UART3 signal line function value: UART3_URXD3 */
#define PIO_PC31C_UART3_URXD3                      (_U_(1) << 31) /**< UART3 signal: UART3_URXD3 */
#define PIN_PB12C_UART3_UTXD3                      _L_(44)      /**< UART3 signal: UART3_UTXD3 on PB12 mux C */
#define MUX_PB12C_UART3_UTXD3                      _L_(2)       /**< UART3 signal line function value: UART3_UTXD3 */
#define PIO_PB12C_UART3_UTXD3                      (_U_(1) << 12) /**< UART3 signal: UART3_UTXD3 */
#define PIN_PC13D_UART3_UTXD3                      _L_(77)      /**< UART3 signal: UART3_UTXD3 on PC13 mux D */
#define MUX_PC13D_UART3_UTXD3                      _L_(3)       /**< UART3 signal line function value: UART3_UTXD3 */
#define PIO_PC13D_UART3_UTXD3                      (_U_(1) << 13) /**< UART3 signal: UART3_UTXD3 */
#define PIN_PD0C_UART3_UTXD3                       _L_(96)      /**< UART3 signal: UART3_UTXD3 on PD0 mux C */
#define MUX_PD0C_UART3_UTXD3                       _L_(2)       /**< UART3 signal line function value: UART3_UTXD3 */
#define PIO_PD0C_UART3_UTXD3                       (_U_(1) << 0) /**< UART3 signal: UART3_UTXD3 */
/* ========== PIO definition for UART4 peripheral ========== */
#define PIN_PB3A_UART4_URXD4                       _L_(35)      /**< UART4 signal: UART4_URXD4 on PB3 mux A */
#define MUX_PB3A_UART4_URXD4                       _L_(0)       /**< UART4 signal line function value: UART4_URXD4 */
#define PIO_PB3A_UART4_URXD4                       (_U_(1) << 3) /**< UART4 signal: UART4_URXD4 */
#define PIN_PB4A_UART4_UTXD4                       _L_(36)      /**< UART4 signal: UART4_UTXD4 on PB4 mux A */
#define MUX_PB4A_UART4_UTXD4                       _L_(0)       /**< UART4 signal line function value: UART4_UTXD4 */
#define PIO_PB4A_UART4_UTXD4                       (_U_(1) << 4) /**< UART4 signal: UART4_UTXD4 */

#endif /* _SAMA5D27_GPIO_H_ */

